# Pandas

In [2]:
import pandas as pd

## Series

In [2]:
data = pd.Series(['Data1', 'Data2', 'Data3'])
print(type(data))
print(data)

<class 'pandas.core.series.Series'>
0    Data1
1    Data2
2    Data3
dtype: object

In [3]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [4]:
data.index = ['A', 'B', 'C']

In [7]:
data

A    Data1
B    Data2
C    Data3
dtype: object

In [6]:
print(data[0])
print(data['A'])
print(data.at['A'])

Data1
Data1
Data1

C:\Users\Asus\AppData\Local\Temp\ipykernel_3480\2566075894.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(data[0])

In [8]:
print(data[:2])
print(data[:'B'])

A    Data1
B    Data2
dtype: object
A    Data1
B    Data2
dtype: object

In [9]:
data = pd.Series(data=['Audi', 'Porsche', 'Bugatti', 'Lotus'], 
                 index=['C1', 'C2', 'C3', 'C4'], 
                 name='Autos')
print(data)

C1       Audi
C2    Porsche
C3    Bugatti
C4      Lotus
Name: Autos, dtype: object

In [10]:
print(data.index)
print(data.name)
print(data.values)

Index(['C1', 'C2', 'C3', 'C4'], dtype='object')
Autos
['Audi' 'Porsche' 'Bugatti' 'Lotus']

In [11]:
data.sort_values()

C1       Audi
C3    Bugatti
C4      Lotus
C2    Porsche
Name: Autos, dtype: object

In [12]:
for item in data:
    print(item)

Audi
Porsche
Bugatti
Lotus

In [13]:
data.sort_values(inplace=True)

In [14]:
for item in data:
    print(item)

Audi
Bugatti
Lotus
Porsche

In [15]:
data

C1       Audi
C3    Bugatti
C4      Lotus
C2    Porsche
Name: Autos, dtype: object

In [16]:
# LOC (localizacion por etiqueta), ILOC (localizacion por indice entero <int>)
data.loc['C2']

'Porsche'

In [17]:
data.iloc[2]

'Lotus'

In [18]:
data.iloc[::-1]

C2    Porsche
C4      Lotus
C3    Bugatti
C1       Audi
Name: Autos, dtype: object

In [19]:
data.loc['C1': 'C4']

C1       Audi
C3    Bugatti
C4      Lotus
Name: Autos, dtype: object

In [20]:
data.loc[['C1', 'C2']]

C1       Audi
C2    Porsche
Name: Autos, dtype: object

In [21]:
data = pd.Series([10, 20, 30])
data

0    10
1    20
2    30
dtype: int64

In [22]:
data * 2

0    20
1    40
2    60
dtype: int64

In [23]:
data + data

0    20
1    40
2    60
dtype: int64

In [24]:
data = pd.Series(['A', 'B', 'C'])
data

0    A
1    B
2    C
dtype: object

In [25]:
data + data

0    AA
1    BB
2    CC
dtype: object

In [26]:
from random import randint

numbers = [randint(1, 100) for _ in range(25)]
data = pd.Series(numbers)
data

0     24
1     89
2     61
3     65
4     61
5      8
6     82
7     89
8     12
9     49
10    52
11    65
12    72
13     1
14    58
15    48
16    26
17    82
18    72
19    88
20    58
21    72
22    55
23    32
24    33
dtype: int64

In [27]:
data % 3 == 0

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9     False
10    False
11    False
12     True
13    False
14    False
15     True
16    False
17    False
18     True
19    False
20    False
21     True
22    False
23    False
24     True
dtype: bool

In [29]:
idx_bool = (data % 3 == 0)
data[idx_bool]

0     24
8     12
12    72
15    48
18    72
21    72
24    33
dtype: int64

In [30]:
data = pd.Series([80, 76, 66])
data.index = ['Elvio', 'Dina', 'Elmer']
data

Elvio    80
Dina     76
Elmer    66
dtype: int64

In [31]:
data.rename({'Dina': 'Dina Mita', 'Elmer': 'Elmer Curio', 'Elvio': 'Elvio Lado'})

Elvio Lado     80
Dina Mita      76
Elmer Curio    66
dtype: int64

In [32]:
data.rename(lambda x: "Dr. " + x)

Dr. Elvio    80
Dr. Dina     76
Dr. Elmer    66
dtype: int64

In [ ]:
data.drop(index=['Dina'])

In [33]:
import numpy as np

data = pd.Series([1, 10, np.nan, 12, 22, np.nan])
data

0     1.0
1    10.0
2     NaN
3    12.0
4    22.0
5     NaN
dtype: float64

In [34]:
data.isna()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [35]:
data.dropna()

0     1.0
1    10.0
3    12.0
4    22.0
dtype: float64

In [36]:
data.fillna(0)

0     1.0
1    10.0
2     0.0
3    12.0
4    22.0
5     0.0
dtype: float64

In [ ]:
data

In [37]:
print(len(data))
print(data.size)

6
6

In [38]:
print(sum(data))
print(data.sum())

nan
45.0

In [ ]:
data

In [39]:
print(data.count())
print(data.sum())
print(data.mean())
print(data.median())
print(data.max())
print(data.min())
print(data.argmax())
print(data.argmin())

4
45.0
11.25
11.0
22.0
1.0
4
0

In [40]:
data.dropna(inplace=True)

In [41]:
data

0     1.0
1    10.0
3    12.0
4    22.0
dtype: float64

In [42]:
dir(data)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__bool__',
 '__class__',
 '__column_consortium_standard__',
 '__contains__',
 '__copy__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__float__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__int__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pandas_priority__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_for_op',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_as_manager',
 '_attrs',
 '_binop',
 '_can_hold_na',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_result',
 '_constructor',
 '_constructor_expanddim',
 '_constructor_expanddim_from_mgr',
 '_constructor_from_mgr',
 '_convert_dtypes',
 '_data',
 '_deprecate_downcast',
 '_dir_additions',
 '_dir_deletions',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_duplicated',
 '_expanddim_from_mgr',
 '_find_valid_index',
 '_flags',
 '_flex_method',
 '_from_mgr',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cacher',
 '_get_cleaned_column_resolvers',
 '_get_index_resolvers',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_rows_with_mask',
 '_get_value',
 '_get_values_tuple',
 '_get_with',
 '_getitem_slice',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_init_dict',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_cached',
 '_is_copy',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_item_cache',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_map_values',
 '_maybe_update_cacher',
 '_memory_usage',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_name',
 '_needs_reindex_multi',
 '_pad_or_backfill',
 '_protect_consolidate',
 '_reduce',
 '_references',
 '_reindex_axes',
 '_reindex_indexer',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_single',
 '_repr_data_resource_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_set_as_cached',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_labels',
 '_set_name',
 '_set_value',
 '_set_values',
 '_set_with',
 '_set_with_engine',
 '_shift_with_freq',
 '_slice',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'backfill',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'ge',
 'get',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'interpolate',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'set_flags',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [43]:
data.apply(lambda x: int(x))

0     1
1    10
3    12
4    22
dtype: int64

In [44]:
from math import sin

data.apply(lambda x: sin(x))

0    0.841471
1   -0.544021
3   -0.536573
4   -0.008851
dtype: float64

## Aplicación
Se tiene información de los tiempos promedio de un conjunto de 25 nadadores de 100 mt y se quiere seleccionar a los 5 que tengan un mejor tiempo.

In [21]:
import numpy as np
import pandas as pd

tiempos = pd.Series(data=np.random.uniform(90, 180, 25), 
                    index=[f"Atleta {x}" for x in range(1, 26)])
tiempos

Atleta 1     104.249488
Atleta 2     171.597908
Atleta 3     128.043406
Atleta 4     127.312573
Atleta 5     115.714132
Atleta 6     107.546422
Atleta 7     128.228820
Atleta 8     104.004085
Atleta 9      93.420187
Atleta 10    110.773027
Atleta 11    123.658689
Atleta 12    173.370834
Atleta 13    171.457799
Atleta 14    171.891250
Atleta 15    166.417704
Atleta 16    148.870401
Atleta 17    170.974913
Atleta 18    143.783741
Atleta 19    145.223128
Atleta 20    157.865996
Atleta 21    107.919602
Atleta 22    170.137134
Atleta 23    100.216550
Atleta 24    154.052401
Atleta 25    136.286623
dtype: float64

In [53]:
tiempos.sort_values().iloc[:5].apply(lambda x: round(x, 2)).apply(lambda x: f"{x} seg")

Atleta 19     98.34 seg
Atleta 14    100.36 seg
Atleta 6     106.01 seg
Atleta 22    108.46 seg
Atleta 8     110.07 seg
dtype: object

In [62]:
tiempos[(tiempos > 135) & (tiempos < 155)].rename(lambda x: f"Atleta {x.split()[-1]:0>2}").sort_index()

Atleta 07    152.370429
Atleta 21    140.396507
dtype: float64

## DataFrame

In [3]:
df = pd.DataFrame(['A', 'B', 'C'])
df

   0
0  A
1  B
2  C

In [4]:
df = pd.DataFrame([['A', 'B', 'C'], ['D', 'E', 'F'], ['G', 'H', 'I']])
df

   0  1  2
0  A  B  C
1  D  E  F
2  G  H  I

In [5]:
df = pd.DataFrame(data=[['A', 'B', 'C'], ['D', 'E', 'F'], ['G', 'H', 'I']], 
                  columns=['C1', 'C2', 'C3'], 
                  index=['I1', 'I2', 'I3'])
df

   C1 C2 C3
I1  A  B  C
I2  D  E  F
I3  G  H  I

In [6]:
df = pd.DataFrame(data={'C1': ['A', 'B', 'C'], 'C2': ['D', 'E', 'F'], 'C3': ['G', 'H', 'I']}, 
                  index = ['I1', 'I2', 'I3'])
df

   C1 C2 C3
I1  A  D  G
I2  B  E  H
I3  C  F  I

In [7]:
df['C1']

I1    A
I2    B
I3    C
Name: C1, dtype: object

In [8]:
df.loc['I1']      # Array[filas, columnas]     # df.loc[filas, columnas]

C1    A
C2    D
C3    G
Name: I1, dtype: object

In [9]:
df.iloc[0]

C1    A
C2    D
C3    G
Name: I1, dtype: object

In [10]:
df.loc['I1', :]

C1    A
C2    D
C3    G
Name: I1, dtype: object

In [11]:
df.iloc[0, :]

C1    A
C2    D
C3    G
Name: I1, dtype: object

In [12]:
df.loc['I2', 'C1']   # filas, columnas

'B'

In [13]:
df.iloc[:, 1]

I1    D
I2    E
I3    F
Name: C2, dtype: object

In [14]:
df.iloc[:, 1:2]

   C2
I1  D
I2  E
I3  F

In [16]:
for col in df:
    #print(col)
    print(df.get(col))

I1    A
I2    B
I3    C
Name: C1, dtype: object
I1    D
I2    E
I3    F
Name: C2, dtype: object
I1    G
I2    H
I3    I
Name: C3, dtype: object

In [17]:
df = pd.DataFrame(data=[['A', 'B', 'C'], ['D', 'E', 'F'], ['G', 'H', 'I']], 
                  columns=['C1', 'C2', 'C3'], 
                  index=['I1', 'I2', 'I3'])
df

   C1 C2 C3
I1  A  B  C
I2  D  E  F
I3  G  H  I

In [18]:
df.drop(index='I1')

   C1 C2 C3
I2  D  E  F
I3  G  H  I

In [ ]:
df.drop(columns='C2')   # inplace=True

In [19]:
columns = df.pop('C2')
print(columns)
print(df)

I1    B
I2    E
I3    H
Name: C2, dtype: object
   C1 C3
I1  A  C
I2  D  F
I3  G  I

In [22]:
numeros = np.random.randint(10, 50, (5, 8))
df = pd.DataFrame(numeros, columns=[f"C{idx}" for idx in range(1, 9)])
df

   C1  C2  C3  C4  C5  C6  C7  C8
0  13  44  37  20  27  37  45  30
1  38  46  38  48  39  10  34  33
2  35  19  31  30  34  45  14  40
3  17  48  17  10  45  35  37  41
4  35  24  33  42  11  38  13  49

In [23]:
df.mean()

C1    27.6
C2    36.2
C3    31.2
C4    30.0
C5    31.2
C6    33.0
C7    28.6
C8    38.6
dtype: float64

In [24]:
df.mean(axis=1)

0    31.625
1    35.750
2    31.000
3    31.250
4    30.625
dtype: float64

In [25]:
df.iloc[:, 2:5].mean()

C3    31.2
C4    30.0
C5    31.2
dtype: float64

## Aplicación
Se tiene un registro de 5 notas de 16 estudiantes y se quieren realizar algunas acciones sobre esta información:

1. Obtener el promedio por cada evaluacion
2. Obtener el promedio por estudiante
3. Obtener el listado de los estudiantes que han aprobado el promedio de evaluaciones (>11.5)
4. Modificar las notas de la evaluacion 5 de tal forma que los estudiantes que tengan < 8 tengan ayuda de 3 puntos y mostrar los nuevos promedios

In [48]:
import pandas as pd
import numpy as np

notas = pd.DataFrame(data=np.random.randint(3, 20, (16, 5)), 
                     index=[f"Estudiante {x}" for x in range(1, 17)], 
                     columns=['N1', 'N2', 'N3', 'N4', 'N5'])
notas

               N1  N2  N3  N4  N5
Estudiante 1   10   3   7   7  18
Estudiante 2    6  19  17  11  13
Estudiante 3    6   3  12  11  15
Estudiante 4   15   3   8   3   7
Estudiante 5   18  14   4  10   8
Estudiante 6    7  17  10   7  19
Estudiante 7    4   6   6  14   5
Estudiante 8   15  17   6   8   7
Estudiante 9    4  18   3  11  11
Estudiante 10   7   3   7   7   6
Estudiante 11  17   3  17   9  10
Estudiante 12   8  11  19  10  12
Estudiante 13  12  11   7   7   9
Estudiante 14  13   8  17  11   4
Estudiante 15   7  15  10  17  13
Estudiante 16  17  18  13   5   9

In [49]:
notas.mean(axis=0)

N1    10.3750
N2    10.5625
N3    10.1875
N4     9.2500
N5    10.3750
dtype: float64

In [50]:
notas.mean(axis=1)

Estudiante 1      9.0
Estudiante 2     13.2
Estudiante 3      9.4
Estudiante 4      7.2
Estudiante 5     10.8
Estudiante 6     12.0
Estudiante 7      7.0
Estudiante 8     10.6
Estudiante 9      9.4
Estudiante 10     6.0
Estudiante 11    11.2
Estudiante 12    12.0
Estudiante 13     9.2
Estudiante 14    10.6
Estudiante 15    12.4
Estudiante 16    12.4
dtype: float64

In [51]:
notas.mean(axis=1)[notas.mean(axis=1) >= 11.5].sort_values(ascending=False)

Estudiante 2     13.2
Estudiante 15    12.4
Estudiante 16    12.4
Estudiante 6     12.0
Estudiante 12    12.0
dtype: float64

In [52]:
notas['PROM'] = notas.mean(axis=1)

In [53]:
notas

               N1  N2  N3  N4  N5  PROM
Estudiante 1   10   3   7   7  18   9.0
Estudiante 2    6  19  17  11  13  13.2
Estudiante 3    6   3  12  11  15   9.4
Estudiante 4   15   3   8   3   7   7.2
Estudiante 5   18  14   4  10   8  10.8
Estudiante 6    7  17  10   7  19  12.0
Estudiante 7    4   6   6  14   5   7.0
Estudiante 8   15  17   6   8   7  10.6
Estudiante 9    4  18   3  11  11   9.4
Estudiante 10   7   3   7   7   6   6.0
Estudiante 11  17   3  17   9  10  11.2
Estudiante 12   8  11  19  10  12  12.0
Estudiante 13  12  11   7   7   9   9.2
Estudiante 14  13   8  17  11   4  10.6
Estudiante 15   7  15  10  17  13  12.4
Estudiante 16  17  18  13   5   9  12.4

In [54]:
notas[notas['PROM'] >= 11.5].sort_values(by='PROM', ascending=False)

               N1  N2  N3  N4  N5  PROM
Estudiante 2    6  19  17  11  13  13.2
Estudiante 15   7  15  10  17  13  12.4
Estudiante 16  17  18  13   5   9  12.4
Estudiante 6    7  17  10   7  19  12.0
Estudiante 12   8  11  19  10  12  12.0

In [58]:
notas['N5'] = notas['N5'].apply(lambda x: x + 3 if x < 12 else x)
notas['PROM'] = notas.loc[:, 'N1': 'N5'].mean(axis=1)

In [59]:
notas[notas['PROM'] >= 11.5].sort_values(by='PROM', ascending=False)

               N1  N2  N3  N4  N5  PROM
Estudiante 2    6  19  17  11  13  13.2
Estudiante 16  17  18  13   5  12  13.0
Estudiante 15   7  15  10  17  13  12.4
Estudiante 6    7  17  10   7  19  12.0
Estudiante 12   8  11  19  10  12  12.0
Estudiante 8   15  17   6   8  13  11.8
Estudiante 11  17   3  17   9  13  11.8
Estudiante 14  13   8  17  11  10  11.8

## Agrupacion de columnas: GroupBy

In [60]:
df = pd.DataFrame(data={'Producto': ['A', 'A', 'B', 'C', 'B', 'C', 'C', 'B', 'A', 'B'], 
                        'Ciclo': ['Q1', 'Q2', 'Q1', 'Q3', 'Q2', 'Q3', 'Q1', 'Q2', 'Q2', 'Q3'], 
                        'Ventas': [10122, 17276, 28373, 11822, 12323, 23422, 23412, 19292, 19238, 28282]})
df

  Producto Ciclo  Ventas
0        A    Q1   10122
1        A    Q2   17276
2        B    Q1   28373
3        C    Q3   11822
4        B    Q2   12323
5        C    Q3   23422
6        C    Q1   23412
7        B    Q2   19292
8        A    Q2   19238
9        B    Q3   28282

In [63]:
df[['Producto', 'Ventas']].groupby(by='Producto').sum()

          Ventas
Producto
A          46636
B          88270
C          58656

In [64]:
df.groupby(by=['Producto', 'Ciclo']).sum()

                Ventas
Producto Ciclo
A        Q1      10122
         Q2      36514
B        Q1      28373
         Q2      31615
         Q3      28282
C        Q1      23412
         Q3      35244

In [65]:
df.groupby(by=['Ciclo', 'Producto']).sum()

                Ventas
Ciclo Producto
Q1    A          10122
      B          28373
      C          23412
Q2    A          36514
      B          31615
Q3    B          28282
      C          35244

In [67]:
df.groupby(by=['Producto', 'Ciclo']).agg(['sum', 'mean', 'count'])    # .agg({'ventas': 'sum', 'cantidad': 'count'})

               Ventas
                  sum     mean count
Producto Ciclo
A        Q1     10122  10122.0     1
         Q2     36514  18257.0     2
B        Q1     28373  28373.0     1
         Q2     31615  15807.5     2
         Q3     28282  28282.0     1
C        Q1     23412  23412.0     1
         Q3     35244  17622.0     2

## Importaciones de Fuentes de Datos

### CSV

In [68]:
df = pd.read_csv("dataset_la_liga.csv")

In [69]:
df.head()

,season,club,home_win,away_win,home_loss,away_loss,matches_won,matches_lost,matches_drawn,total_matches,points,home_goals,away_goals,goals_scored,goals_conceded,goal_difference
0,1970-71,Real Zaragoza,3,0,5,13,3,18,9,30,18,14,8,22,54,-32
1,1970-71,Elche,4,0,5,11,4,16,10,30,22,17,8,25,46,-21
2,1970-71,Las Palmas,5,0,3,12,5,15,10,30,25,25,8,33,42,-9
3,1970-71,Sabadell,8,0,3,14,8,17,5,30,29,19,9,28,49,-21
4,1970-71,Espanyol,7,1,4,9,8,13,9,30,33,13,5,18,25,-7

In [70]:
df.describe()

,home_win,away_win,home_loss,away_loss,matches_won,matches_lost,matches_drawn,total_matches,points,home_goals,away_goals,goals_scored,goals_conceded,goal_difference
count,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000,908.000000
mean,9.582599,4.118943,4.118943,9.582599,13.701542,13.701542,9.577093,36.980176,50.681718,29.508811,18.267621,47.776432,47.776432,0.000000
std,3.107555,2.776725,2.531206,3.092974,4.966050,4.589442,2.986852,2.522150,14.104626,9.757192,7.569011,15.593429,11.855507,21.680653
min,1.000000,0.000000,0.000000,1.000000,2.000000,1.000000,1.000000,30.000000,13.000000,11.000000,4.000000,15.000000,18.000000,-64.000000
25%,7.000000,2.000000,2.000000,8.000000,10.000000,11.000000,7.000000,34.000000,42.000000,23.000000,13.000000,37.000000,39.000000,-14.000000
50%,9.000000,4.000000,4.000000,10.000000,13.000000,14.000000,9.000000,38.000000,48.000000,28.000000,17.000000,45.000000,47.000000,-3.000000
75%,12.000000,6.000000,6.000000,12.000000,16.000000,17.000000,12.000000,38.000000,59.000000,34.000000,22.000000,54.000000,56.000000,10.250000
max,19.000000,16.000000,15.000000,18.000000,32.000000,29.000000,18.000000,44.000000,100.000000,78.000000,58.000000,121.000000,94.000000,89.000000

In [71]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 908 entries, 0 to 907
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   season           908 non-null    object
 1   club             908 non-null    object
 2   home_win         908 non-null    int64
 3   away_win         908 non-null    int64
 4   home_loss        908 non-null    int64
 5   away_loss        908 non-null    int64
 6   matches_won      908 non-null    int64
 7   matches_lost     908 non-null    int64
 8   matches_drawn    908 non-null    int64
 9   total_matches    908 non-null    int64
 10  points           908 non-null    int64
 11  home_goals       908 non-null    int64
 12  away_goals       908 non-null    int64
 13  goals_scored     908 non-null    int64
 14  goals_conceded   908 non-null    int64
 15  goal_difference  908 non-null    int64
dtypes: int64(14), object(2)
memory usage: 113.6+ KB

## Excel Files

In [72]:
df = pd.read_excel("SampleData.xlsx", sheet_name='SalesOrders')

In [73]:
df.head()   # df.tail(n=5)

   OrderDate   Region      Rep    Item  Units  Unit Cost   Total
0 2019-01-06     East    Jones  Pencil     95       1.99  189.05
1 2019-01-23  Central   Kivell  Binder     50      19.99  999.50
2 2019-02-09  Central  Jardine  Pencil     36       4.99  179.64
3 2019-02-26  Central     Gill     Pen     27      19.99  539.73
4 2019-03-15     West  Sorvino  Pencil     56       2.99  167.44

In [74]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43 entries, 0 to 42
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderDate  43 non-null     datetime64[ns]
 1   Region     43 non-null     object
 2   Rep        43 non-null     object
 3   Item       43 non-null     object
 4   Units      43 non-null     int64
 5   Unit Cost  43 non-null     float64
 6   Total      43 non-null     float64
dtypes: datetime64[ns](1), float64(2), int64(1), object(3)
memory usage: 2.5+ KB

### HTML

In [76]:
import requests

URL = "https://es.wikipedia.org/wiki/Am%C3%A9rica_del_Sur"
r = requests.get(URL)
r

In [77]:
data = pd.read_html(r.content)
print(type(data))
len(data)

<class 'list'>

41

In [78]:
df = data[2]
df.head()

,Posición,Posición mundial,País,Punto más alto,Altitud,Sistema
0,1,10,Argentina,Cerro Aconcagua,6961 m s. n. m.,Cordillera de los Andes
1,2,11,Argentina y Chile,Nevado Ojos del Salado,6891 m s. n. m.,Cordillera de los Andes
2,3,12,Perú,Nevado Huascarán,6768 m s. n. m.,Cordillera de los Andes
3,4,13,Bolivia,Nevado Sajama,6542 m s. n. m.,Cordillera de los Andes
4,5,14,Ecuador,Monte Chimborazo,6263 m s. n. m.,Cordillera de los Andes

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Posición          14 non-null     int64
 1   Posición mundial  14 non-null     int64
 2   País              14 non-null     object
 3   Punto más alto    14 non-null     object
 4   Altitud           14 non-null     object
 5   Sistema           14 non-null     object
dtypes: int64(2), object(4)
memory usage: 804.0+ bytes

In [83]:
df['Altitud'] = df['Altitud'].apply(lambda x: x.split()[0]).apply(lambda x: int(x))

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Posición          14 non-null     int64
 1   Posición mundial  14 non-null     int64
 2   País              14 non-null     object
 3   Punto más alto    14 non-null     object
 4   Altitud           14 non-null     int64
 5   Sistema           14 non-null     object
dtypes: int64(3), object(3)
memory usage: 804.0+ bytes

In [85]:
df

,Posición,Posición mundial,País,Punto más alto,Altitud,Sistema
0,1,10,Argentina,Cerro Aconcagua,6961,Cordillera de los Andes
1,2,11,Argentina y Chile,Nevado Ojos del Salado,6891,Cordillera de los Andes
2,3,12,Perú,Nevado Huascarán,6768,Cordillera de los Andes
3,4,13,Bolivia,Nevado Sajama,6542,Cordillera de los Andes
4,5,14,Ecuador,Monte Chimborazo,6263,Cordillera de los Andes
5,6,19,Colombia,Pico Cristóbal Colón & Simón Bolívar,5775,Sierra Nevada de Santa Marta
6,7,28,Venezuela,Pico Bolívar,4978,Cordillera de los Andes
7,8,72,Brasil,Pico da Neblina,2995,Escudo guayanés
8,9,89,"Brasil, Guyana y Venezuela",Tepuy Roraima,2810,Sierra de Pacaraima
9,10,158,Surinam,Juliana Top,1280,Montañas Wilhelmina
10,11,175,Trinidad y Tobago,Cerro del Aripo,940,Cordillera del Norte
11,12,181,Guayana Francesa,Monte Bellevue,851,Escudo Guayanés
12,13,182,Paraguay,Cerro Tres Kandú,842,Cordillera de Ybytyruzú
13,14,198,Uruguay,Cerro Catedral,514,Cuchilla Grande

In [86]:
df.index = df['Posición']

In [89]:
df.drop(columns=['Posición'], inplace=True)

In [90]:
df

,Posición mundial,País,Punto más alto,Altitud,Sistema
Posición,,,,,
1,10,Argentina,Cerro Aconcagua,6961,Cordillera de los Andes
2,11,Argentina y Chile,Nevado Ojos del Salado,6891,Cordillera de los Andes
3,12,Perú,Nevado Huascarán,6768,Cordillera de los Andes
4,13,Bolivia,Nevado Sajama,6542,Cordillera de los Andes
5,14,Ecuador,Monte Chimborazo,6263,Cordillera de los Andes
6,19,Colombia,Pico Cristóbal Colón & Simón Bolívar,5775,Sierra Nevada de Santa Marta
7,28,Venezuela,Pico Bolívar,4978,Cordillera de los Andes
8,72,Brasil,Pico da Neblina,2995,Escudo guayanés
9,89,"Brasil, Guyana y Venezuela",Tepuy Roraima,2810,Sierra de Pacaraima
10,158,Surinam,Juliana Top,1280,Montañas Wilhelmina
11,175,Trinidad y Tobago,Cerro del Aripo,940,Cordillera del Norte
12,181,Guayana Francesa,Monte Bellevue,851,Escudo Guayanés
13,182,Paraguay,Cerro Tres Kandú,842,Cordillera de Ybytyruzú
14,198,Uruguay,Cerro Catedral,514,Cuchilla Grande

In [93]:
URL = "https://es-us.finanzas.yahoo.com/quote/BTC-USD/history?p=BTC-USD"
r = requests.get(URL, headers={'User-Agent':'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/91.0.4472.124 Safari/537.36'})
r

In [94]:
data = pd.read_html(r.content)
df = data[0]
df.head()

,Fecha,Abrir,Alto,Bajo,Cierre*,Cierre ajustado**,Volumen
0,17 may 2024,65241.33,66940.84,65179.25,66940.84,66940.84,29180190720
1,16 may 2024,66256.11,66712.43,64613.05,65231.58,65231.58,31573077994
2,15 may 2024,61553.99,66454.45,61330.41,66267.49,66267.49,39815167074
3,14 may 2024,62900.77,63092.13,61123.77,61552.79,61552.79,28186271527
4,13 may 2024,61451.22,63422.66,60769.84,62901.45,62901.45,27889181179

In [95]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101 entries, 0 to 100
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Fecha              101 non-null    object
 1   Abrir              101 non-null    object
 2   Alto               101 non-null    object
 3   Bajo               101 non-null    object
 4   Cierre*            101 non-null    object
 5   Cierre ajustado**  101 non-null    object
 6   Volumen            101 non-null    object
dtypes: object(7)
memory usage: 5.7+ KB

### DataFrame.to_datetime y DatetimeIndex

In [96]:
df.tail()

,Fecha,Abrir,Alto,Bajo,Cierre*,Cierre ajustado**,Volumen
96,11 feb 2024,47768.97,48535.94,47617.41,48293.92,48293.92,19315867136
97,10 feb 2024,47153.53,48146.17,46905.32,47771.28,47771.28,16398681570
98,09 feb 2024,45297.38,48152.50,45260.82,47147.20,47147.20,39316770844
99,08 feb 2024,44332.13,45575.84,44332.13,45301.57,45301.57,26154524080
100,*Precio de cierre ajustado para división de ac...,*Precio de cierre ajustado para división de ac...,*Precio de cierre ajustado para división de ac...,*Precio de cierre ajustado para división de ac...,*Precio de cierre ajustado para división de ac...,*Precio de cierre ajustado para división de ac...,*Precio de cierre ajustado para división de ac...

In [97]:
df.drop(index=100, inplace=True)

In [99]:
def change_month(texto):
    meses = {'ene ': 'jan ', 
             'feb ': 'feb ', 
             'mar ': 'mar ', 
             'abr ': 'apr ', 
             'may ': 'may ', 
             'jun ': 'jun ', 
             'jul ': 'jul ', 
             'ago ': 'ago ', 
             'set ': 'sep ',
             'sept': 'sep ',
             'oct ': 'oct ', 
             'nov ': 'nov ', 
             'dic ': 'dec '}
    
    for k, v in meses.items():
        if k in texto:
            return texto.replace(k, v)

In [100]:
df['Fecha'] = pd.to_datetime(df['Fecha'].apply(lambda x: change_month(x)), format="%d %b %Y")

In [101]:
df.head()

,Fecha,Abrir,Alto,Bajo,Cierre*,Cierre ajustado**,Volumen
0,2024-05-17,65241.33,66940.84,65179.25,66940.84,66940.84,29180190720
1,2024-05-16,66256.11,66712.43,64613.05,65231.58,65231.58,31573077994
2,2024-05-15,61553.99,66454.45,61330.41,66267.49,66267.49,39815167074
3,2024-05-14,62900.77,63092.13,61123.77,61552.79,61552.79,28186271527
4,2024-05-13,61451.22,63422.66,60769.84,62901.45,62901.45,27889181179

In [102]:
df.index = pd.DatetimeIndex(df['Fecha'])

In [103]:
df.drop(columns='Fecha', inplace=True)

In [104]:
df.head()

,Abrir,Alto,Bajo,Cierre*,Cierre ajustado**,Volumen
Fecha,,,,,,
2024-05-17,65241.33,66940.84,65179.25,66940.84,66940.84,29180190720
2024-05-16,66256.11,66712.43,64613.05,65231.58,65231.58,31573077994
2024-05-15,61553.99,66454.45,61330.41,66267.49,66267.49,39815167074
2024-05-14,62900.77,63092.13,61123.77,61552.79,61552.79,28186271527
2024-05-13,61451.22,63422.66,60769.84,62901.45,62901.45,27889181179

In [105]:
columns = ['Abrir', 'Alto', 'Bajo', 'Cierre*', 'Cierre ajustado**']
for column in columns:
    df[column] = df[column].apply(lambda x: float(x))
else:
    df['Volumen'] = df['Volumen'].apply(lambda x: int(x))

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 100 entries, 2024-05-17 to 2024-02-08
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Abrir              100 non-null    float64
 1   Alto               100 non-null    float64
 2   Bajo               100 non-null    float64
 3   Cierre*            100 non-null    float64
 4   Cierre ajustado**  100 non-null    float64
 5   Volumen            100 non-null    int64
dtypes: float64(5), int64(1)
memory usage: 5.5 KB

In [107]:
df.head()

,Abrir,Alto,Bajo,Cierre*,Cierre ajustado**,Volumen
Fecha,,,,,,
2024-05-17,65241.33,66940.84,65179.25,66940.84,66940.84,29180190720
2024-05-16,66256.11,66712.43,64613.05,65231.58,65231.58,31573077994
2024-05-15,61553.99,66454.45,61330.41,66267.49,66267.49,39815167074
2024-05-14,62900.77,63092.13,61123.77,61552.79,61552.79,28186271527
2024-05-13,61451.22,63422.66,60769.84,62901.45,62901.45,27889181179